export interface ActivityData {
  title: string;
  date: string;
  link?: string;
  descriptions: string[]; // 웹 화면에서는 한 줄씩, 인쇄용에서는 이어서 표시
}

export interface ActivityCategory {
  name: string;
  items: ActivityData[];
}

export const activities: ActivityCategory[] = [
  {
    name: "수상경력",
    items: [
      {
        title: "2022 경기 콘텐츠 창의학교 경진대회 대상 (경기도교육감상)",
        date: "2022-11",
        link: "https://www.kgnews.co.kr/news/article.html?no=727771",
        descriptions: [
          "경기 콘텐츠 창의학교 교육 프로그램에 참여한 특성화고와 마이스터고 학생들이",
          "개발한 콘텐츠 프로젝트 결과물을 최종 발표하는 행사에 참여하여",
          "리미디(우울증 치료에 도움을 주는 디지털 치료 모바일 앱)을 제작,",
          "대상(경기도교육감 상)을 수상하였습니다.",
        ],
      },
      {
        title: "2022 전국기능경기대회 웹디자인 및 개발 동메달 (3위)",
        date: "2022-09",
        descriptions: [
          "주어진 주제에 맞게 웹사이트를 기획, 디자인, 개발하는 대회에",
          "경기도 대표로 전국 3위를 수상하였습니다.",
        ],
      },
      {
        title: "2022 경기도 기능경기대회 웹디자인 및 개발 부문 금메달 (1위)",
        date: "2022-04",
        descriptions: [
          "주어진 주제에 맞게 웹사이트를 기획, 디자인, 개발하는 대회에",
          "출전하여 1위, 금메달을 수상하였습니다.",
        ],
      },
      {
        title: "2021 전국기능경기대회 웹디자인 및 개발 우수상 (4위)",
        date: "2021-10",
        descriptions: [
          "주어진 주제와 맞게 웹사이트를 기획, 디자인, 개발하는 대회에",
          "경기도 대표로 출전하여 전국 4위 우수상을 수상하였습니다.",
        ],
      },
      {
        title: "2021 전국기능경기대회 웹디자인 및 개발 팀챌린지 대상 (1위)",
        date: "2021-10",
        descriptions: [
          "대회에 참여한 사람들과 랜덤하게 팀을 이루어 협업하여",
          "주제에 맞는 프로젝트를 개발, 홍보와 발표까지 진행하는 대회에서",
          "1위 대상을 수상했습니다.",
        ],
      },
      {
        title: "2021 경기도 기능경기대회 웹디자인 및 개발 동메달 (3위)",
        date: "2021-04",
        descriptions: [
          "주어진 주제에 맞게 웹사이트를 기획, 디자인, 개발하는 대회에",
          "출전하여 3위를 수상하였습니다.",
        ],
      },
    ],
  },
  {
    name: "자격증",
    items: [
      {
        title: "정보처리기능사",
        date: "2024-04",
        descriptions: [
          "소프트웨어, 정보통신 관련 분야에 전문성을 높이기 위해",
          "한국산업인력공단에서 시행하는 정보처리기능사 자격증을 취득하였습니다.",
        ],
      },
      {
        title: "정보기기운용기능사",
        date: "2022-06",
        descriptions: [
          "네트워크 관련 분야에 관심이 있어",
          "한국산업인력공단에서 시행하는 기능사 자격증을 취득하였습니다.",
        ],
      },
      {
        title: "웹디자인기능사",
        date: "2021-07",
        descriptions: [
          "웹 개발 직무에 전문성을 키우기 위하여",
          "한국산업인력공단에서 시행하는 기능사 자격증을 취득하였습니다.",
        ],
      },
      {
        title: "GTQ 1급",
        date: "2021-06",
        descriptions: [
          "웹 디자인 분야에 관심이 있어",
          "한국생산성본부에서 실시하는 GTQ 자격증의 포토샵 부문을 취득하였습니다.",
        ],
      },
    ],
  },
  {
    name: "기타",
    items: [
      {
        title: "2024 국제기능올림픽 1차 국가대표 선발전 참가",
        date: "2023-07",
        descriptions: [
          "2023년에 개최한 2024년도 국제기능올림픽 대회 국가대표 선발전에",
          "모바일앱개발 직종으로 참가하였습니다.",
        ],
      },
    ],
  },
];
